#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dcentric-health/gh-actions-vault/runs/run-vAwx6Uy24XzkyHyZ

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.default: Reading...
module.loadbalancer_sg.aws_security_group.this_name_prefix[0] (deposed object 8f5f7f22): Refreshing state... [id=sg-0e42f75c08f4c8553]
data.aws_ami.selected: Reading...
module.alb.aws_lb_target_group.main[0] (deposed object 70291a0c): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad]
module.instance_sg.aws_security_group.this_name_prefix[0] (deposed object 6d7cb156): Refreshing state... [id=sg-01540647fb1a33ec2]
data.aws_ami.selected: Read complete after 0s [id=ami-03c04a76b30467c2d]
data.aws_vpc.default: Read complete after 1s [id=vpc-ff49b386]
data.aws_subnet_ids.all: Reading...
module.loadbalancer_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0f1edc4a9a0b67eec]
module.instance_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-09f37922137d45401]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221107041203498000000001/8e9fc3a08d3e4b3f]
module.loadbalancer_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2948341219]
module.loadbalancer_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1225039191]
module.instance_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-874433113]
module.instance_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3185590649]
aws_launch_template.this: Refreshing state... [id=lt-0afbad080f4ad42e8]
data.aws_subnet_ids.all: Read complete after 0s [id=vpc-ff49b386]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:loadbalancer/app/test-rolling/5881a8d833c68349]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:listener/app/test-rolling/5881a8d833c68349/fc67da85a67017e4]
aws_cloudformation_stack.this: Refreshing state... [id=arn:aws:cloudformation:eu-west-1:277142373668:stack/test-rolling/d2dfc8f0-5d33-11ed-93b5-02f6ef265489]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.alb.aws_lb_listener.frontend_http_tcp[0] has changed
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:listener/app/test-rolling/5881a8d833c68349/fc67da85a67017e4"
      ~ port              = 443 -> 80
      ~ protocol          = "HTTPS" -> "HTTP"
        tags              = {}
        # (3 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221107041203498000000001/8e9fc3a08d3e4b3f" -> "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad"
            # (2 unchanged attributes hidden)
        }
    }

  # module.instance_sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        id                     = "sg-09f37922137d45401"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Ingress Rule"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0f1edc4a9a0b67eec",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "test-rolling_instances_sg-20221107041204422000000002"
        tags                   = {
            "Name" = "test-rolling_instances_sg"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.loadbalancer_sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "Egress Rule"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-09f37922137d45401",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        id                     = "sg-0f1edc4a9a0b67eec"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "test-rolling_lb_sg-20221107041204426200000003"
        tags                   = {
            "Name" = "test-rolling_lb_sg"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_cloudformation_stack.this will be updated in-place
  ~ resource "aws_cloudformation_stack" "this" {
        id                 = "arn:aws:cloudformation:eu-west-1:277142373668:stack/test-rolling/d2dfc8f0-5d33-11ed-93b5-02f6ef265489"
        name               = "test-rolling"
        tags               = {}
      ~ template_body      = <<-EOT
            Resources:
              ASG:
                Type: AWS::AutoScaling::AutoScalingGroup
                Properties:
                  AutoScalingGroupName: "test-rolling"
                  HealthCheckGracePeriod: 300
                  DesiredCapacity: 2
                  MaxSize: 2
                  MinSize: 1
                  VPCZoneIdentifier: ["subnet-51d5e237","subnet-5315131b","subnet-6d0f7f37"]
                  TargetGroupARNs: ["arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad"]
                  Tags: []
                  HealthCheckType: EC2
            
                  MixedInstancesPolicy:
                    InstancesDistribution:
                      OnDemandBaseCapacity: 0
                      OnDemandPercentageAboveBaseCapacity: 0
                      SpotAllocationStrategy: capacity-optimized
                    LaunchTemplate:
                      LaunchTemplateSpecification:
                        LaunchTemplateName: "test-rolling20221105175905155600000004"
                        Version: "1"
                      Overrides: []
            
                UpdatePolicy:
                # Ignore differences in group size properties caused by scheduled actions
                  AutoScalingScheduledAction:
                    IgnoreUnmodifiedGroupSizeProperties: true
                  AutoScalingRollingUpdate:
                    MinSuccessfulInstancesPercent: 50
                    PauseTime: PT10M
                    SuspendProcesses:
                      - HealthCheck
                      - ReplaceUnhealthy
                      - AZRebalance
                      - AlarmNotification
                      - ScheduledActions
                    WaitOnResourceSignals: true
            
                DeletionPolicy: Delete
        EOT -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-0afbad080f4ad42e8"
      ~ image_id                = "ami-01484fd504342261b" -> "ami-03c04a76b30467c2d"
      ~ latest_version          = 3 -> (known after apply)
        name                    = "test-rolling20221105175905155600000004"
        tags                    = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:listener/app/test-rolling/5881a8d833c68349/fc67da85a67017e4"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.alb.aws_lb_target_group.main[0] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221107041203498000000001/8e9fc3a08d3e4b3f" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/h120221107041203498000000001/8e9fc3a08d3e4b3f" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221107041203498000000001/8e9fc3a08d3e4b3f" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "h120221107041203498000000001" -> (known after apply)
      ~ port                               = 443 -> 80 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol                           = "HTTPS" -> "HTTP" # forces replacement
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Name" = "h1"
        }
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ protocol            = "HTTPS" -> "HTTP"
            # (8 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

      ~ target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group.main[0] (deposed object 70291a0c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lb_target_group" "main" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad" -> null
      - arn_suffix                         = "targetgroup/h120221105175903169200000003/1eaec8046ee69dad" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "10" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "h120221105175903169200000003" -> null
      - name_prefix                        = "h1" -> null
      - port                               = 80 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Name" = "h1"
        } -> null
      - tags_all                           = {
          - "Name" = "h1"
        } -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-ff49b386" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200-399" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 6 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}
    }

  # module.instance_sg.aws_security_group.this_name_prefix[0] (deposed object 6d7cb156) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "this_name_prefix" {
      - arn                    = "arn:aws:ec2:eu-west-1:277142373668:security-group/sg-01540647fb1a33ec2" -> null
      - description            = "Security group for example usage with EC2 Instances" -> null
      - egress                 = [] -> null
      - id                     = "sg-01540647fb1a33ec2" -> null
      - ingress                = [] -> null
      - name                   = "test-rolling_instances_sg-20221105175903166000000002" -> null
      - name_prefix            = "test-rolling_instances_sg-" -> null
      - owner_id               = "277142373668" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "test-rolling_instances_sg"
        } -> null
      - tags_all               = {
          - "Name" = "test-rolling_instances_sg"
        } -> null
      - vpc_id                 = "vpc-ff49b386" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "15m" -> null
        }
    }

  # module.instance_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0] must be replaced
-/+ resource "aws_security_group_rule" "computed_ingress_with_source_security_group_id" {
      ~ from_port                = 443 -> 80 # forces replacement
      ~ id                       = "sgrule-874433113" -> (known after apply)
      ~ to_port                  = 443 -> 80 # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.loadbalancer_sg.aws_security_group.this_name_prefix[0] (deposed object 8f5f7f22) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "this_name_prefix" {
      - arn                    = "arn:aws:ec2:eu-west-1:277142373668:security-group/sg-0e42f75c08f4c8553" -> null
      - description            = "Security group for example usage with ALB" -> null
      - egress                 = [] -> null
      - id                     = "sg-0e42f75c08f4c8553" -> null
      - ingress                = [] -> null
      - name                   = "test-rolling_lb_sg-20221105175903164500000001" -> null
      - name_prefix            = "test-rolling_lb_sg-" -> null
      - owner_id               = "277142373668" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "test-rolling_lb_sg"
        } -> null
      - tags_all               = {
          - "Name" = "test-rolling_lb_sg"
        } -> null
      - vpc_id                 = "vpc-ff49b386" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "15m" -> null
        }
    }

  # module.loadbalancer_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0] must be replaced
-/+ resource "aws_security_group_rule" "computed_egress_with_source_security_group_id" {
      ~ from_port                = 443 -> 80 # forces replacement
      ~ id                       = "sgrule-1225039191" -> (known after apply)
      ~ to_port                  = 443 -> 80 # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.loadbalancer_sg.aws_security_group_rule.ingress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "ingress_rules" {
      ~ description              = "HTTPS" -> "HTTP"
      ~ from_port                = 443 -> 80 # forces replacement
      ~ id                       = "sgrule-2948341219" -> (known after apply)
      + source_security_group_id = (known after apply)
      ~ to_port                  = 443 -> 80 # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 4 to add, 3 to change, 7 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with data.aws_subnet_ids.all,
│   on data.tf line 5, in data "aws_subnet_ids" "all":
│    5: data "aws_subnet_ids" "all" {
│ 
│ The aws_subnet_ids data source has been deprecated and will be removed in a
│ future version. Use the aws_subnets data source instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pushed by: @linerocks, Action: `pull_request`*